import styles from "../css/Footer.module.css"

export default function Default_Footer(){
    return(
        <div className={styles.Footer}>
            <div className={styles.FootContent}>
                <section className={styles.sectionTop}>
                    <section>
                        <div id={styles.downloadSign}>
                            당근마켓 앱 다운로드
                        </div>
                        <div id={styles.Btns}>
                            <button id={styles.appleBtn}>
                                <img alt="" src="/img/Apple_logo_black.svg.png"/>App Store
                            </button>
                            <button id={styles.googleBtn}>
                                <img alt="" src="/img/play_store_logo.png"/>Google Play
                            </button>
                        </div>
                    </section>
                    <nav>
                        <div>
                            <p>중고거래</p>
                            <p>동네거래</p>
                            <p>당근알바</p>
                        </div>
                        <div>
                            <p>당근비지니스</p>
                            <p>채팅하기</p>
                        </div>
                        <div>
                            <p>자주 묻는 질문</p>
                            <p>회사 소개</p>
                            <p>인재 채용</p>
                        </div>
                    </nav>
                </section>
                <section className={styles.infoBox}>
                    <section id={styles.info}>
                        <section>
                            <div>
                                <span><b>대표</b> 김용현, 황도연</span>
                                <span className={styles.dashline}>|</span>
                                <span><b>사업자번호</b> 375-87-00088</span>
                            </div>
                            <div>
                                <span><b>직업정보제공사업 신고번호</b> 2016-서울서초-0051</span>
                            </div>
                            <div>
                                <span><b>주소</b> 서울특별시 구로구 디지털로 30길 28, 609호 (당근서비스)<br/></span>
                            </div>
                            <div>
                                <span><b>전화</b> 1544-9796</span>
                                <span className={styles.dashline}>|</span>
                                <span><b>고객문의</b> cs@daangnservice.com</span>
                            </div>
                        </section>
                        <section>
                            <b>제휴 문의</b>
                            <b>광고 문의</b>
                            <b>PR 문의</b>
                            <b>IR 문의</b>
                        </section>
                        <section>
                            <b>이용약관</b>
                            <b id={styles.emphasis}>개인정보처리방침</b>
                            <b>위치기반서비스 이용약관</b>
                            <b>이용자보호 비전과 계획</b>
                        </section>
                    </section>
                    <section id={styles.snsBox}>
                        <sapn>
                            <svg xmlns="http://www.w3.org/2000/svg" x="0px" y="0px"width="30" height="30"viewBox="0 0 30 30">
                            <path d="M15,3C8.373,3,3,8.373,3,15c0,6.016,4.432,10.984,10.206,11.852V18.18h-2.969v-3.154h2.969v-2.099c0-3.475,1.693-5,4.581-5 c1.383,0,2.115,0.103,2.461,0.149v2.753h-1.97c-1.226,0-1.654,1.163-1.654,2.473v1.724h3.593L19.73,18.18h-3.106v8.697 C22.481,26.083,27,21.075,27,15C27,8.373,21.627,3,15,3z"></path>
                            </svg>
                        </sapn>
                        <sapn>
                            <svg xmlns="http://www.w3.org/2000/svg" x="0px" y="0px"width="30" height="30"viewBox="0 0 24 24">
                                <path d="M 8 3 C 5.243 3 3 5.243 3 8 L 3 16 C 3 18.757 5.243 21 8 21 L 16 21 C 18.757 21 21 18.757 21 16 L 21 8 C 21 5.243 18.757 3 16 3 L 8 3 z M 8 5 L 16 5 C 17.654 5 19 6.346 19 8 L 19 16 C 19 17.654 17.654 19 16 19 L 8 19 C 6.346 19 5 17.654 5 16 L 5 8 C 5 6.346 6.346 5 8 5 z M 17 6 A 1 1 0 0 0 16 7 A 1 1 0 0 0 17 8 A 1 1 0 0 0 18 7 A 1 1 0 0 0 17 6 z M 12 7 C 9.243 7 7 9.243 7 12 C 7 14.757 9.243 17 12 17 C 14.757 17 17 14.757 17 12 C 17 9.243 14.757 7 12 7 z M 12 9 C 13.654 9 15 10.346 15 12 C 15 13.654 13.654 15 12 15 C 10.346 15 9 13.654 9 12 C 9 10.346 10.346 9 12 9 z"></path>
                            </svg>
                        </sapn>
                        <sapn>
                            <svg xmlns="http://www.w3.org/2000/svg" x="0px" y="0px"width="30" height="30"viewBox="0 0 24 24">
                                <path d="M21.582,6.186c-0.23-0.86-0.908-1.538-1.768-1.768C18.254,4,12,4,12,4S5.746,4,4.186,4.418 c-0.86,0.23-1.538,0.908-1.768,1.768C2,7.746,2,12,2,12s0,4.254,0.418,5.814c0.23,0.86,0.908,1.538,1.768,1.768 C5.746,20,12,20,12,20s6.254,0,7.814-0.418c0.861-0.23,1.538-0.908,1.768-1.768C22,16.254,22,12,22,12S22,7.746,21.582,6.186z M10,14.598V9.402c0-0.385,0.417-0.625,0.75-0.433l4.5,2.598c0.333,0.192,0.333,0.674,0,0.866l-4.5,2.598 C10.417,15.224,10,14.983,10,14.598z"></path>
                            </svg>
                        </sapn>
                        <sapn>
                            <svg xmlns="http://www.w3.org/2000/svg" x="0px" y="0px"width="30" height="30"viewBox="0 0 50 50">
                                <path d="M 9 4 C 6.2504839 4 4 6.2504839 4 9 L 4 41 C 4 43.749516 6.2504839 46 9 46 L 41 46 C 43.749516 46 46 43.749516 46 41 L 46 9 C 46 6.2504839 43.749516 4 41 4 L 9 4 z M 9 6 L 41 6 C 42.668484 6 44 7.3315161 44 9 L 44 41 C 44 42.668484 42.668484 44 41 44 L 9 44 C 7.3315161 44 6 42.668484 6 41 L 6 9 C 6 7.3315161 7.3315161 6 9 6 z M 20 11 C 15.054545 11 11 15.054545 11 20 L 11 25 L 11 30 C 11 34.945455 15.054545 39 20 39 L 30 39 C 34.945455 39 39 34.945455 39 30 L 39 24 C 39 22.35503 37.64497 21 36 21 L 35 21 C 34.43497 21 34 20.56503 34 20 C 34 15.054545 29.945455 11 25 11 L 20 11 z M 20 13 L 25 13 C 28.854545 13 32 16.145455 32 20 C 32 21.64497 33.35503 23 35 23 L 36 23 C 36.56503 23 37 23.43497 37 24 L 37 30 C 37 33.854545 33.854545 37 30 37 L 20 37 C 16.145455 37 13 33.854545 13 30 L 13 25 L 13 20 C 13 16.145455 16.145455 13 20 13 z M 20 17 C 18.354545 17 17 18.354545 17 20 C 17 21.645455 18.354545 23 20 23 L 25 23 C 26.645455 23 28 21.645455 28 20 C 28 18.354545 26.645455 17 25 17 L 20 17 z M 20 19 L 25 19 C 25.554545 19 26 19.445455 26 20 C 26 20.554545 25.554545 21 25 21 L 20 21 C 19.445455 21 19 20.554545 19 20 C 19 19.445455 19.445455 19 20 19 z M 20 27 C 18.354545 27 17 28.354545 17 30 C 17 31.645455 18.354545 33 20 33 L 30 33 C 31.645455 33 33 31.645455 33 30 C 33 28.354545 31.645455 27 30 27 L 20 27 z M 20 29 L 30 29 C 30.554545 29 31 29.445455 31 30 C 31 30.554545 30.554545 31 30 31 L 20 31 C 19.445455 31 19 30.554545 19 30 C 19 29.445455 19.445455 29 20 29 z"></path>
                            </svg>
                        </sapn>
                        <div>
                            <select>
                                <option>한국</option>
                                <option>영국</option>
                                <option>미국</option>
                                <option>캐나다</option>
                                <option>일본</option>
                            </select>
                        </div>
                    </section>
                </section>
            </div>
        </div>
    )
}